gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
		send_serial = 0;

		r=0;
		s=1;
		t=2;

		#ifdef USAR_DFT
		somaMr=0;
		somaMs=0;
		somaMt=0;

		somaFr=0;
		somaFs=0;
		somaFt=0;
		#endif

		//Aplicacao da DFT
		int k2 = 0;
		for (k=0;k<n_amostras;k++){
			//##############################
			// Para FFT
			FasesAC_ReIm_R[k2]=FasesAC[r];
			FasesAC_ReIm_S[k2]=FasesAC[s];
			FasesAC_ReIm_T[k2]=FasesAC[t];
			FasesAC_ReIm_R[k2+1]=0;
			FasesAC_ReIm_S[k2+1]=0;
			FasesAC_ReIm_T[k2+1]=0;

			k2 += 2;
			//##############################

			#ifdef USAR_DFT
			modulor = FasesAC[r]*cosseno[k];
			modulos = FasesAC[s]*cosseno[k];
			modulot = FasesAC[t]*cosseno[k];

			faser = FasesAC[r]*seno[k];
			fases = FasesAC[s]*seno[k];
			faset = FasesAC[t]*seno[k];

			somaMr += modulor;
			somaMs += modulos;
			somaMt += modulot;

			somaFr += faser;
			somaFs += fases;
			somaFt += faset;
			#endif

			r +=3;
			s +=3;
			t +=3;
		}

		//##############################
		// Para FFT
		arm_cfft_f32(&arm_cfft_sR_f32_len256,FasesAC_ReIm_R,0,1);
		arm_cmplx_mag_f32(FasesAC_ReIm_R,FasesAC_mod_R,256);

		arm_cfft_f32(&arm_cfft_sR_f32_len256,FasesAC_ReIm_S,0,1);
		arm_cmplx_mag_f32(FasesAC_ReIm_S,FasesAC_mod_S,256);

		arm_cfft_f32(&arm_cfft_sR_f32_len256,FasesAC_ReIm_T,0,1);
		arm_cmplx_mag_f32(FasesAC_ReIm_T,FasesAC_mod_T,256);
		//##############################

		//##############################
		// Cálculo de harmônicas da fase AC

		Mag_R = FasesAC_mod_R[1];
		Mag_S = FasesAC_mod_S[1];
		Mag_T = FasesAC_mod_T[1];

		// Ajuste do ganho de tensão (normalizado para a tensão 127V ou 220V)
		arm_scale_f32(FasesAC_mod_R,Harmonics_gain[0]*invN, FasesAC_mod_R,numero_pontos);
		arm_scale_f32(FasesAC_mod_S,Harmonics_gain[1]*invN, FasesAC_mod_S,numero_pontos);
		arm_scale_f32(FasesAC_mod_T,Harmonics_gain[2]*invN, FasesAC_mod_T,numero_pontos);

		// Se precisar a amplitude de cada harmônica com um valor diferente
		//arm_mult_f32(FasesAC_mod_R, CalibHarmonicas_mag, FasesAC_mod_R,numero_pontos);

		// Calculo de THD e fase das harmônicas
		float tmp_THD_R = 0.0;
		float tmp_THD_S = 0.0;
		float tmp_THD_T = 0.0;
		for(k=0;k<15;k++){
			harmonics_R_mag[k] = FasesAC_mod_R[k+2];
			// Calcula fase em radianos das harmônicas da fase R
			harmonics_R_phase[k] = atan2(FasesAC_ReIm_R[2*k+5],FasesAC_ReIm_R[2*k+4]);//*180/M_PI;
			tmp_THD_R += harmonics_R_mag[k]*harmonics_R_mag[k];

			harmonics_S_mag[k] = FasesAC_mod_S[k+2];
			// Calcula fase em radianos das harmônicas da fase S
			harmonics_S_phase[k] = atan2(FasesAC_ReIm_S[2*k+5],FasesAC_ReIm_S[2*k+4]);//*180/M_PI;
			tmp_THD_S += harmonics_S_mag[k]*harmonics_S_mag[k];

			harmonics_T_mag[k] = FasesAC_mod_T[k+2];
			// Calcula fase em radianos das harmônicas da fase T
			harmonics_T_phase[k] = atan2(FasesAC_ReIm_T[2*k+5],FasesAC_ReIm_T[2*k+4]);//*180/M_PI;
			tmp_THD_T += harmonics_T_mag[k]*harmonics_T_mag[k];
			// calibração de fase das harmônicas ???
			//harmonics_phase[k] = harmonics_phase[k] - CalibHarmonicas_phase[k];
		}
		arm_sqrt_f32(tmp_THD_R, &THD_R);
		THD_R = (THD_R / FasesAC_mod_R[1])*100;
		arm_sqrt_f32(tmp_THD_S, &THD_S);
		THD_S = (THD_S / FasesAC_mod_S[1])*100;
		arm_sqrt_f32(tmp_THD_T, &THD_T);
		THD_T = (THD_T / FasesAC_mod_T[1])*100;

		// Ajuste das harmônicas para a tensão nominal
	#if (NOMINAL_VOLTAGE == 127)
		float voltage_gain = 89.802561211*PEAK_OR_RMS;
	#endif
	#if (NOMINAL_VOLTAGE == 220)
		float voltage_gain = 155.563491861*PEAK_OR_RMS;
	#endif
		arm_scale_f32(harmonics_R_mag,voltage_gain, harmonics_R_mag,15);
		arm_scale_f32(harmonics_S_mag,voltage_gain, harmonics_S_mag,15);
		arm_scale_f32(harmonics_T_mag,voltage_gain, harmonics_T_mag,15);
		//##############################

		#ifndef USAR_DFT
		Mag_R = PEAK_OR_RMS*invN*Mag_R;
		Fase_R = atan2(FasesAC_ReIm_R[3],FasesAC_ReIm_R[2])*180/M_PI;	//Fase R da harmonica fundamental

		Mag_S = PEAK_OR_RMS*invN*Mag_S;
		Fase_S=atan2(FasesAC_ReIm_S[3],FasesAC_ReIm_S[2])*180/M_PI;	//Fase S da harmonica fundamental

		Mag_T = PEAK_OR_RMS*invN*Mag_T;
		Fase_T=atan2(FasesAC_ReIm_T[3],FasesAC_ReIm_T[2])*180/M_PI;	//Fase T da harmonica fundamental
		#endif

		#ifdef USAR_DFT
		//Fasor em coordenadas retangulares
		Mr=somaMr*2/n_amostras;
		Ms=somaMs*2/n_amostras;
		Mt=somaMt*2/n_amostras;

		Fr=somaFr*2/n_amostras;
		Fs=somaFs*2/n_amostras;
		Ft=somaFt*2/n_amostras;

		//Fasor em coordenadas polares
		Mag_R = (sqrt((Mr*Mr)+(Fr*Fr)))/sqrt(2);
		Mag_S = (sqrt((Ms*Ms)+(Fs*Fs)))/sqrt(2);
		Mag_T = (sqrt((Mt*Mt)+(Ft*Ft)))/sqrt(2);

		Fase_R = (atan2(-Fr,Mr)*180/M_PI);
		Fase_S = (atan2(-Fs,Ms)*180/M_PI);
		Fase_T = (atan2(-Ft,Mt)*180/M_PI);
		#endif

		//Desvio de fase (para estimacao de frequencia)
		desvio_faseR = (Fase_R-Fase_R_ant);
		desvio_faseS = (Fase_S-Fase_S_ant);
		desvio_faseT = (Fase_T-Fase_T_ant);

		Fase_R_ant = Fase_R;
		Fase_S_ant = Fase_S;
		Fase_T_ant = Fase_T;


		// Correção do phase shift
		//Desabilitar essa correção para os testes de frequência em estado estacionário!!
/*
		if(desvio_faseR > (desvio_ang_esp+tolerancia)){
			desvio_faseR = desvio_ang_esp;
		}
		if(desvio_faseR < (desvio_ang_esp-tolerancia)){
			desvio_faseR = desvio_ang_esp;
		}

		if(desvio_faseS > (desvio_ang_esp+tolerancia)){
			desvio_faseS = desvio_ang_esp;
		}
		if(desvio_faseS < (desvio_ang_esp-tolerancia)){
			desvio_faseS = desvio_ang_esp;
		}

		if(desvio_faseT > (desvio_ang_esp+tolerancia)){
			desvio_faseT = desvio_ang_esp;
		}
		if(desvio_faseT < (desvio_ang_esp-tolerancia)){
			desvio_faseT = desvio_ang_esp;
		}
*/


		// Correcao da regiao de 180 graus para o desvio de fase
		if(desvio_faseR>270){
			desvio_faseR = desvio_faseR-360;
		}
		if(desvio_faseR<-270){
			desvio_faseR = desvio_faseR+360;
		}
		if(desvio_faseS>270){
			desvio_faseS = desvio_faseS-360;
		}
		if(desvio_faseS<-270){
			desvio_faseS = desvio_faseS+360;
		}
		if(desvio_faseT>270){
			desvio_faseT = desvio_faseT-360;
		}
		if(desvio_faseT<-270){
			desvio_faseT = desvio_faseT+360;
		}


		//FREQUENCIA E ROCOF FINAL (sem correcoes)
		//Calculo da freq para 30 pulsos e 3 fases

		freq_R = f0 + (desvio_faseR*fps)/360.0;
		freq_S = f0 + (desvio_faseS*fps)/360.0;
		freq_T = f0 + (desvio_faseT*fps)/360.0;

		Freq = (freq_R+freq_S+freq_T)/3.0;

		if(Freq > (NOMINAL_FREQ+5)){
			Freq = (NOMINAL_FREQ+5);
		}else if(Freq < (NOMINAL_FREQ-5)){
			Freq = (NOMINAL_FREQ-5);
		}

		media_freq_2 = (Freq + Freq_ant)/2.0;

		//Desvio de ângulo esperado (para correção do phase shift)
		desvio_ang_esp = 360*(Freq-f0)/fps;


		ROCOF = (Freq - Freq_ant)*fps;

