gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
		Freq_ant = Freq;

		//media movel no valor final do rocof
		n=3;
		vetor_rocof[g] = ROCOF;
		g++;
		for(i=0;i<n;i++){
		    soma_rocof = soma_rocof + vetor_rocof[i];
		    media_rocof = soma_rocof/n;
		}
		soma_rocof = 0;
		if(g==n){
		    g=0;
		}


		// Media movel no valor final da frequencia
		vetor_freq[f] = Freq;
		f++;
		for(i=0;i<2;i++){
		    soma_freq = soma_freq + vetor_freq[i];
		    media_freq = soma_freq/2.0;
		}
		soma_freq = 0;
		if(f==2){
		    f=0;
		}

		Freq_final = media_freq; //+media_rocof/fps;


		// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! TESTES SEM SINAL
		//media_freq = f0;  /////////////////// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
		//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

/*		if(a<25){
			TIM8->ARR = (float)180000000/((50)*n_amostras);
			a++;
		}

*/

		//AJUSTE DA TAXA DE AMOSTRAGEM
#ifdef CORRIGE_RESIDUAL
	#if (OVERSAMPLING  == 1)
		volatile float tmpARR = (float)MCLOCK_FREQ/((media_freq)*n_amostras*4*2);
	#else
		volatile float tmpARR = (float)MCLOCK_FREQ/((media_freq)*n_amostras);
	#endif
		volatile uint32_t tmpARRfix = (uint32_t)tmpARR;
		volatile float residual = tmpARR - (float)tmpARRfix;
#endif

		// O valor correto é o calculado - 1
		/* No entanto, se o valor depois da virgula for maior que 0.5
		   considera-se que o valor não precisa ser diminuido de 1 */
		#ifdef CORRIGE_RESIDUAL
			#ifdef PPS_30_HZ
			if (residual > 0.5){
				htim1.Instance->ARR = tmpARRfix;
			}else{
				htim1.Instance->ARR = tmpARRfix - 1;
			}
			#else
			if (residual > 0.5){
				htim8.Instance->ARR = tmpARRfix;
			}else{
				htim8.Instance->ARR = tmpARRfix - 1;
			}
			#endif
		#endif

		/*********************************************************/
		//APLICAÇÃO DAS CORREÇÕES (em magnitude e fase)

		//MAGNITUDE- ajuste da magnitude
		// Y-data = Magnitude reference - X-data = Magnitude measured (não em p.u.)

		MagR_x_mag = FIT_MAG_GAIN_A_R + FIT_MAG_GAIN_B_R*Mag_R + FIT_MAG_GAIN_C_R*Mag_R*Mag_R - FIT_MAG_GAIN_D_R*Mag_R*Mag_R*Mag_R;
		MagS_x_mag = FIT_MAG_GAIN_A_S + FIT_MAG_GAIN_B_S*Mag_S + FIT_MAG_GAIN_C_S*Mag_S*Mag_S - FIT_MAG_GAIN_D_S*Mag_S*Mag_S*Mag_S;
		MagT_x_mag = FIT_MAG_GAIN_A_T + FIT_MAG_GAIN_B_T*Mag_T + FIT_MAG_GAIN_C_T*Mag_T*Mag_T - FIT_MAG_GAIN_D_T*Mag_T*Mag_T*Mag_T;

		//FASE
		//correcao de fase em funcao da magnitude
		// Y-data = Phase deviation - X-data = Magnitude measured (não em p.u.)

		faseR_x_mag = Fase_R - FIT_PHASE_GAIN_A_R + FIT_PHASE_GAIN_B_R*MagR_x_mag - FIT_PHASE_GAIN_C_R*MagR_x_mag*MagR_x_mag;
	#ifdef FIT_PHASE_GAIN_D_S
		faseS_x_mag = Fase_S - FIT_PHASE_GAIN_A_S + FIT_PHASE_GAIN_B_S*MagS_x_mag - FIT_PHASE_GAIN_C_S*MagS_x_mag*MagS_x_mag + FIT_PHASE_GAIN_D_S*MagS_x_mag*MagS_x_mag*MagS_x_mag;
	#else
		faseS_x_mag = Fase_S - FIT_PHASE_GAIN_A_S + FIT_PHASE_GAIN_B_S*MagS_x_mag - FIT_PHASE_GAIN_C_S*MagS_x_mag*MagS_x_mag;
	#endif
	#ifdef FIT_PHASE_GAIN_D_T
		faseT_x_mag = Fase_T - FIT_PHASE_GAIN_A_T + FIT_PHASE_GAIN_B_T*MagT_x_mag - FIT_PHASE_GAIN_C_T*MagT_x_mag*MagT_x_mag + FIT_PHASE_GAIN_D_T*MagT_x_mag*MagT_x_mag*MagT_x_mag;
	#else
		faseT_x_mag = Fase_T - FIT_PHASE_GAIN_A_T + FIT_PHASE_GAIN_B_T*MagT_x_mag - FIT_PHASE_GAIN_C_T*MagT_x_mag*MagT_x_mag;
	#endif

		// FREQUENCIA
		//correcao de fase em funcao da frequencia
		// Y-data = phase deviation - X-data = frequency reference
		faseR_x_freq = FIT_FREQ_GAIN_A_R + FIT_FREQ_GAIN_B_R*Freq_final;
		faseS_x_freq = FIT_FREQ_GAIN_A_S + FIT_FREQ_GAIN_B_S*Freq_final;
		faseT_x_freq = FIT_FREQ_GAIN_A_T + FIT_FREQ_GAIN_B_T*Freq_final;

		// Calcula magnitude final
		// Ajustes do ganho de magnitude:
		// Sensor AZUL:
		Mag_R_final = MagR_x_mag * MAG_GAIN_R; //Mag_R;
		Mag_S_final = MagS_x_mag * MAG_GAIN_S;
		Mag_T_final = MagT_x_mag * MAG_GAIN_T; //MagT_x_mag;


		//Calcula fase final (aplica as correcoes anteriores)
		Fase_R_final = faseR_x_mag + faseR_x_freq;
		Fase_S_final = faseS_x_mag + faseS_x_freq;
		Fase_T_final = faseT_x_mag + faseT_x_freq;

		// Correcao da regiao de 180 graus para a fase final
		if(Fase_R_final > 180.0){
			Fase_R_final = (Fase_R_final-360);
		}
		if(Fase_R_final <= -180.0){
			Fase_R_final = (Fase_R_final+360);
		}
		if(Fase_S_final>180.0){
			Fase_S_final = (Fase_S_final-360);
		}
		if(Fase_S_final<= -180.0){
			Fase_S_final = (Fase_S_final+360);
		}
		if(Fase_T_final>180.0){
			Fase_T_final = (Fase_T_final-360);
		}
		if(Fase_T_final<= -180.0){
			Fase_T_final = (Fase_T_final+360);
		}


	#ifdef PLATAFORMA_DE_TESTES
		// DADOS DA TRANSMISSAO (via serial pro PC)
		buffer[0] = Mag_R_final;
		buffer[1] = Fase_R_final;
		buffer[2] = Freq_final;
		buffer[3] = media_rocof;

		// Envia os dados pela serial
		uint8_t *dados = (uint8_t*)&buffer;
		UARTPutString(dados,16);
	#endif

	#ifdef PPS_30_HZ
		if (frame_cnt){
			FracSec += FRACAO_DE_SEGUNDO;
			if (FracSec > LIMITE_FRACAO_DE_SEGUNDO){
				taskENTER_CRITICAL();
				newSOC = 0;
				FracSec = 0;
				taskEXIT_CRITICAL();
			}
		}else{
			FracSec = FRACAO_DE_SEGUNDO_INIT;
		}

		frame_cnt++;
		if (frame_cnt >= (NOMINAL_FREQ/2)){
			frame_cnt = 0;
		}
	#endif

		if((isSyncCreated == 1) && (data_flag)){
				cnt = 0;
				osSemaphoreRelease(syncSem_id);

		}
		BSP_LED_Toggle(LED1);

	}
}




extern xSemaphoreHandle sUART;
char teste;

void GPS_Task(void const * argument)
{

	osMessageQDef(SerialGPSq, 128, unsigned char);
	SerialGPSq = osMessageCreate(osMessageQ(SerialGPSq), NULL);


	sUART = xSemaphoreCreateBinary();
	MX_USART6_UART_Init();
	HAL_UART_Receive_IT(&huart6, (uint8_t*)&teste, 1);

	while(1){
	    volatile unsigned char *p;

		p = (unsigned char*)&dado_gps;

		/*Liga o GPS*/
		HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_1, GPIO_PIN_SET);

		do{
			UARTGetChar(&huart6, (uint8_t*)p, osWaitForever);
		  }while(*p != '$');

		p--;

		do{
		   p++;
		   UARTGetChar(&huart6, (uint8_t*)p, osWaitForever);
		}while(*p != '\n');

		uint8_t date_calc = 0;
		uint8_t valid_data = 0;
		uint8_t hora_calc = 0;
		uint8_t substring=1;
		struct tm t;

		char* str = strtok(dado_gps, ",");

		/*Verifica se chegou informações de Data e Hora*/
		if (strcmp(str, "GPRMC\0") != 0){
			substring = 10; /*Se a mensagem recebida não for correta*/
		}

		if (substring < 10){
			// Foi identificada uma mensagem válida
			str+=6;

			while (substring <=9){
				if (substring == 1 && *str != ','){
					t.tm_hour = 10*( *str++ - 48);
					t.tm_hour += (*str++ - 48);
					t.tm_min = 10*(*str++ - 48);
					t.tm_min += (*str++ - 48);
					t.tm_sec = 10*(*str++ - 48);
					t.tm_sec += (*str++ - 48);
					hora_calc = 1;
				}else if (substring ==2 && *str != ','){
                    //Não precisa de dados válidos para data e hora
					//if (*str++ == 'A')
						valid_data=1;
				}
				else if (substring == 9 && *str != ','){
					t.tm_mday = 10*( *str++ - 48);
					t.tm_mday += ( *str++ - 48);
					t.tm_mon = 10*( *str++ - 48);
					t.tm_mon += ( *str++ - 48) - 1;
					t.tm_year = 2000+10*( *str++ - 48);
					t.tm_year += ( *str++  - 48) - 1900;
					t.tm_isdst = -1;
					date_calc = 1;
				}

				while (*str++ != ',');
				substring++;
			}

			/*Verifica se chegou informações de Data e Hora*/
			if (date_calc && hora_calc && valid_data){
				/*segundo secular UNIX time (1 jan 1970)*/
				SOC = (unsigned long) mktime(&t);

