gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
				/*Novo SOC foi calculado*/
				taskENTER_CRITICAL();
				newSOC = 1;
				taskEXIT_CRITICAL();
			}
		}else{
			// Procura por mensagem UBX, caso não seja mensagem NMEA GPRMC
			// Determina se a mensagem é UBX,04
			if (strcmp(str, "PUBX\0") == 0){
				// Testa se a mensagem é do tipo 4
				if (dado_gps[6] == '4'){
					//Extrai a informação: segundos na semana
					str = strtok(NULL, ",");
					str = strtok(NULL, ",");
					str = strtok(NULL, ",");
					str = strtok(NULL, ",");
					i = 0;
					while(*str){
						if (*str != '.'){
							UTC_TOW[i]=*str++;
							i++;
						}else{
							break;
						}
					}
					UTC_TOW[i] = '\0';

					//Extrai a informação: numero da semana
					i = 0;
					str = strtok(NULL, ",");
					while(*str){
						UTC_WNO[i]=*str++;
						i++;
					}
					UTC_WNO[i] = '\0';

					//Datasheet mentiroso, no  fonte UTC,  GPS! 10 anos de diferença
					week_num = atoi(UTC_WNO);

					sec_of_week = atoi(UTC_TOW);

					//segundo secular UNIX time (since 6 jan 1980)
					SOC = sec_of_week + week_num*604800 + 60*60*24*365*10 + 60*60*24*7;

					/*Novo SOC foi calculado*/
					taskENTER_CRITICAL();
					newSOC = 1;
					taskEXIT_CRITICAL();
				}
			}
		}
	}
}

void UARTGetChar(UART_HandleTypeDef *huart, unsigned char *data, int timeout)
{
	osEvent event;

	if (huart->Instance == USART6)
	{
		event = osMessageGet(SerialGPSq, timeout);
		if(event.status == osEventMessage){
			*data = (unsigned char)event.value.v;
		}
	}

}


//////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
//						FORMATA��O DOS DADOS
//

// IEEE Std C37.118.2 - 2011 - PMU Standard data transfer

// SYNC[1] Second byte
// bit[7] = Reserved
// bits[6,5,4] = Frame Type, bits[3,2,1,0]

#define A_SYNC_AA 0xAA
#define A_SYNC_DATA 0x01
#define A_SYNC_HDR 0x11
#define A_SYNC_CFG1 0x21
#define A_SYNC_CFG2 0x31
#define A_SYNC_CFG3 0x52
#define A_SYNC_CMD 0x41

// IMPLEMENTA��O DO CRC-CCITT
// Baseado na norma

uint16_t CRC_CCITT;

uint16_t ComputeCRC(unsigned char *Message, uint16_t MessLen)
{
	uint16_t crc=0xFFFF;
	uint16_t temp;
	uint16_t quick;
	int i;

	for(i=0;i<MessLen;i++)
	{
		temp = (crc>>8) ^ Message[i];
		crc <<= 8;
		quick = temp ^ (temp >> 4);
		crc ^= quick;
		quick <<=5;
		crc ^= quick;
		quick <<= 7;
		crc ^= quick;
	}
	return crc;
}


#if (ENABLE_HARMONICS == 1)
unsigned char ucData[768];
#else
unsigned char ucData[128];
#endif
unsigned int PmuID = PMUID;			// Identificacao da PMU


/////////////// FRAME DE DADOS
struct frameDataQueue* qUcData = NULL;
int frame_data(uint16_t *size){
	// Se a fila nao existir, cria-la
	if (qUcData == NULL) {
		qUcData = createFDQueue();
	}

	uint16_t i=0;

	#if (ENABLE_HARMONICS == 1)
	memset((void*)ucData, 0, 290);
	#else
	memset((void*)ucData, 0, 50);
	#endif

	// 1. SYNC = Data Message Sync Byte and Frame Type
	ucData[i++] = A_SYNC_AA;   //0
	ucData[i++] = A_SYNC_DATA; //1

	// 2. FRAMESIZE = Tamanho do frame, incluindo CHK
	#if (ENABLE_HARMONICS == 1)
	ucData[i++] = (unsigned char)0x01;   //2
	ucData[i++] = (unsigned char)0x22;   //3
	#else
	ucData[i++] = (unsigned char)0x00;   //2
	ucData[i++] = (unsigned char)0x32;   //3
	#endif

	// 3. IDCODE = ID da fonte de transmissao
	ucData[i++] = (unsigned char)((PmuID & 0xFF00) >> 8);   //4
	ucData[i++] = (unsigned char)(PmuID & 0x00FF);   //5

	// 4. SOC = Second Of Century = Estampa de tempo, segundo secular
	ucData[i++] = (unsigned char)((SOC & 0xFF000000) >> 24);   //6
	ucData[i++] = (unsigned char)((SOC & 0x00FF0000) >> 16);   //7
	ucData[i++] = (unsigned char)((SOC & 0x0000FF00) >> 8);   //8
	ucData[i++] = (unsigned char)(SOC & 0x000000FF);   //9

	// 5. FRACSEC = Fracao do segundo e qualidade do tempo
	ucData[i++] = (unsigned char)((FracSec & 0xFF000000) >> 24);  //10 - Time quality (secao 6.2.2)
	ucData[i++] = (unsigned char)((FracSec & 0x00FF0000) >> 16);  //11 - fracsec
	ucData[i++] = (unsigned char)((FracSec & 0x0000FF00) >> 8);   //12 - fracsec
	ucData[i++] = (unsigned char)(FracSec & 0x000000FF);		  //13 - fracsec
	#ifndef PPS_30_HZ
	FracSec += FRACAO_DE_SEGUNDO;
	#endif

	// 6. STAT = Flags, a criterio do usuario
	ucData[i++] = 0x00;   //14
	ucData[i++] = 0x00;   //15

	// 7. PHASORS
	// Magnitude primeiro - unidades de engenharia
	float Fase_R_rad, Fase_S_rad, Fase_T_rad ;
	// Fase, depois da magnitude -  em radianos
	Fase_R_rad = Fase_R_final*M_PI/180.0;
	Fase_S_rad = Fase_S_final*M_PI/180.0;
	Fase_T_rad = Fase_T_final*M_PI/180.0;

	convert_float_to_char.pf = Mag_R_final;
	ucData[i++] = convert_float_to_char.byte[3];	//16
	ucData[i++] = convert_float_to_char.byte[2];	//17
	ucData[i++] = convert_float_to_char.byte[1];	//18
	ucData[i++] = convert_float_to_char.byte[0];	//19

	convert_float_to_char.pf = Fase_R_rad;
	ucData[i++] = convert_float_to_char.byte[3];	//20
	ucData[i++] = convert_float_to_char.byte[2];	//21
	ucData[i++] = convert_float_to_char.byte[1];	//22
	ucData[i++] = convert_float_to_char.byte[0];	//23

	convert_float_to_char.pf = Mag_S_final;
	ucData[i++] = convert_float_to_char.byte[3];	//24
	ucData[i++] = convert_float_to_char.byte[2];	//25
	ucData[i++] = convert_float_to_char.byte[1];	//26
	ucData[i++] = convert_float_to_char.byte[0];	//27

	convert_float_to_char.pf = Fase_S_rad;
	ucData[i++] = convert_float_to_char.byte[3];	//28
	ucData[i++] = convert_float_to_char.byte[2];	//29
	ucData[i++] = convert_float_to_char.byte[1];	//30
	ucData[i++] = convert_float_to_char.byte[0];	//31

	convert_float_to_char.pf = Mag_T_final;
	ucData[i++] = convert_float_to_char.byte[3];	//32
	ucData[i++] = convert_float_to_char.byte[2];	//33
	ucData[i++] = convert_float_to_char.byte[1];	//34
	ucData[i++] = convert_float_to_char.byte[0];	//35

	convert_float_to_char.pf = Fase_T_rad;
	ucData[i++] = convert_float_to_char.byte[3];	//36
	ucData[i++] = convert_float_to_char.byte[2];	//37
	ucData[i++] = convert_float_to_char.byte[1];	//38
	ucData[i++] = convert_float_to_char.byte[0];	//39

	#if (ENABLE_HARMONICS == 1)
	for (int j = 0; j<10; j++){
		convert_float_to_char.pf = harmonics_R_mag[j];
		ucData[i++] = convert_float_to_char.byte[3];
		ucData[i++] = convert_float_to_char.byte[2];
		ucData[i++] = convert_float_to_char.byte[1];
		ucData[i++] = convert_float_to_char.byte[0];

		convert_float_to_char.pf = harmonics_R_phase[j];
		ucData[i++] = convert_float_to_char.byte[3];
		ucData[i++] = convert_float_to_char.byte[2];
		ucData[i++] = convert_float_to_char.byte[1];
		ucData[i++] = convert_float_to_char.byte[0];
	}

	for (int j = 0; j<10; j++){
		convert_float_to_char.pf = harmonics_S_mag[j];
		ucData[i++] = convert_float_to_char.byte[3];
		ucData[i++] = convert_float_to_char.byte[2];
		ucData[i++] = convert_float_to_char.byte[1];
		ucData[i++] = convert_float_to_char.byte[0];

		convert_float_to_char.pf = harmonics_S_phase[j];
		ucData[i++] = convert_float_to_char.byte[3];
		ucData[i++] = convert_float_to_char.byte[2];
		ucData[i++] = convert_float_to_char.byte[1];
		ucData[i++] = convert_float_to_char.byte[0];
	}

	for (int j = 0; j<10; j++){
		convert_float_to_char.pf = harmonics_T_mag[j];
		ucData[i++] = convert_float_to_char.byte[3];
		ucData[i++] = convert_float_to_char.byte[2];
		ucData[i++] = convert_float_to_char.byte[1];
		ucData[i++] = convert_float_to_char.byte[0];

